#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=05224e67-b8fa-443b-871f-acb3040e8bbb]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8922455-5068-4300-add2-dc1604ebf9ee]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=54045bf5-9c16-41df-87aa-6cf149ecf5ea]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2eec2798-ebef-43da-9215-caf48e5b2f65]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=200efa40-594c-47c8-9a5d-a36c3764c67a]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=60cf3621-874e-4ef2-9637-5c48ce107e20]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=27c1b1b9-40a9-48fc-8769-dc904bc3a145]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=723cc968-2a88-4e28-b0ac-c277498734c7]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9fa72992-16bb-425d-a6ce-73d88f71931a]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1463e80-9214-4c5d-8a03-bda5a5828681]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7efc0fe3-e80e-4025-87f1-93c7f180563c]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1c162e94-e149-427b-8bf8-48d2afc9a818]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c8226787-b58b-499f-b0a6-d883fa768e0e]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3da82ce8-fc93-43ab-b2c2-ee962751fed4]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2713135b-243f-481e-97be-640c34b23892]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f824abd2-5a8e-44eb-9388-7b1793d789eb]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04c90f04-4224-4962-bd11-9e9ba98dafc5]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f98f3160-11ea-4771-a101-a31f444f2a5d]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b6e462a4-feee-4cd9-bf22-c66c32d86811]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=be2ffe35-4ddc-4218-abca-6c41252f1586]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ed0f60bd-8986-425a-a7d6-c81d2b82966c]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a4c955c2-3eae-490d-af4f-a4db8d8f0ff2]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b038e78a-e8f3-4fdd-924d-03472819501b]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c03a9088-6387-4054-9aef-6958773c7ed2]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6c2e5647-f1e4-481d-9f1b-4c4e8e759a79]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f260fa79-f324-4d31-8c34-61bdb9385023]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=85265bc8-746c-4278-b1d3-4dfcc44269e3]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e0ddcb68-4096-42e1-8fd5-2518504141ff]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6adff7c6-2b56-4487-81fe-9f971a811395]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=faf1f28b-4112-4dd2-9a26-c3cbc14a9e4e]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2a8ea77a-cf20-4da2-9409-ab12f7aad71a]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a73c6f7-0a33-4775-899a-9d0976d05b83]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa0b6916-1bab-4a15-915b-c4374fb4ce91]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=31a1cdaa-a51f-43dc-85cf-4c846931ce29]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b1151fa-e4d2-4619-919f-e1e2723d077f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17a09474-dbcb-4bf6-9b37-82d8afd0d7d3]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=39470b38-aaa9-48e5-a6e6-4f66302fcad1]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5c6a2c53-bc74-4f6b-a273-7b7ea8edc89f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b8206f35-b055-4fba-ad25-1b128bf2f2dd]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b46263c0-37c7-4d6d-bb80-11501602777d]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1c78179e-2ab9-45e2-8334-5aa3c09aee32]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a987e1ba-feca-44b9-8921-7cd7e1874e4d]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cf707929-8c9a-43b7-bf96-bbe5c31de2d2]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9000ea25-1b5c-4f18-a84e-137b04b66ce7]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cad7d7a8-a658-4e49-bb6c-5781a807e59e]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2fdc614f-f1c7-46ee-9ce6-b4ee67d2453c]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1144b98a-53a6-45b2-88be-37d1f4f8d883]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2555485a-a51e-4c1b-abf3-a773e3691cfe]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=285ebf48-8e15-4386-aed7-0147382d37f1]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfe34f04-d971-435c-a908-342e2fdf567c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-3-1552"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-3-1552"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-3-1552"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-3-1552"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-3-1552"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-3-1552"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-3-1552"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-3-1552"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-3-1552"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1988 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*